app/controllers/logs_controller.rb

SELECT "logs".* FROM "logs"
---
  def index
    @logs = Log.all

INSERT INTO "logs" ("created_at", "location", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-04-09 21:57:23.630486"], ["location", "109292"], ["updated_at", "2014-04-09 21:57:23.630486"]]
---
  def apicall

    @log = Log.new
    @log.location = params[:location]
    @log.save

SELECT  "logs".* FROM "logs"  WHERE "logs"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_log
      @log = Log.find(params[:id])